<template>
	<el-dialog title="平台供货协议" :visible.sync="show" width="1000px" center lock-scroll :close-on-click-modal="false" :close-on-press-escape="false" :show-close="false">
		<h4>原生联供应链服务有限公司依据以下条件和条款为您提供所享有的服务，请仔细阅读并遵守。</h4>
		<p>
			欢迎阅读众陶联供应链服务有限公司（UCA）服务条款协议(下称“本协议”)。本协议阐述之条款和条件适用于您使用众陶联交易平台（所涉域名为：www.ucacc.com，下同），所提供的在全球企业间(B2B)交易市场中进行贸易和交流的各种工具和服务(下称“服务”)。
		</p>
		<h5>一、接受条款</h5>
		<p>
			本协议内容包括协议正文及所有UCA已经发布或将来可能发布的各类规则。所有规则为协议不可分割的一部分，与协议正文具有同等法律效力。
			以任何方式进入UCA平台并使用服务即表示您已充分阅读、理解并同意接受本协议的条款和条件(以下合称“条款”)。
			UCA有权根据业务需要酌情修订“条款”，并以网站公告的形式进行更新，不再单独通知予您。经修订的“条款”一经在UCA平台公布，即产生效力。如您不同意相关修订，请您立即停止使用“服务”。如您继续使用“服务”，则将视为您已接受经修订的“条款”，当您与UCA发生争议时，应以最新的“条款”为准。
		</p>
		<h5>二、注册</h5>
		<p>服务使用对象</p>
		<p>
			您确认，在您完成注册程序或以其他UCA允许的方式实际使用服务时，您应当是具备完全民事权利能力和与所从事的民事行为相适应的行为能力的自然人、法人或其他组织。若您不具备前述主体资格，请勿使用服务，否则您及您的监护人应承担因此而导致的一切后果，且UCA有权注销（永久冻结）您的账户，并向您及您的监护人索偿。如您代表一家公司或其他法律主体在UCA平台登记，则您声明和保证，您有权使该公司或该法律主体受本协议“条款”的约束。
		</p>
		<p>注册账户</p>
		<p>
			2.1在您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，或在您按照激活页面提示填写信息、阅读并同意本协议且完成全部激活程序后，或您以其他UCA允许的方式实际使用UCA服务时，您即受本协议的约束。您可以使用您提供或确认的邮箱、手机号码或者UCA允许的其它方式作为登录手段进入UCA平台。
		</p>
		<p>
			2.2您了解并同意，如您系在本网站完成的注册程序，只要您注册成功，您即可以获得您的UCA支付系统登录名。您可以通过您的UCA支付系统登录名直接登录UCA支付系统和UCA旗下支持UCA支付系统登录名登录的任意网站，包括UCA平台、UCA物流平台以及后续可能开通的其他网站/服务（以下合称“UCA平台”），无需重新注册。您在此明确授权，您的账户信息在您注册成功时，已授权本平台披露给所有UCA平台并同时授权UCA平台使用，以使您更便捷地使用UCA平台服务。
		</p>
		<p>
			2.3您可以对账户设置昵称，但您设置的昵称不得侵犯或涉嫌侵犯他人合法权益。如您设置的昵称涉嫌侵犯他人合法权益，UCA有权终止向您提供服务，并注销您的账户。账户注销后，相应的昵称将开放给其他有权用户登记使用。
		</p>
		<p>
			2.4在完成注册或激活流程时，您应当按照法律法规要求，按相应页面的提示准确提供并及时更新您的资料，以使之真实、及时，完整和准确。如有合理理由怀疑您提供的资料错误、不实、过时或不完整的，UCA有权向您发出询问及/或要求改正的通知，并有权直接做出删除相应资料的处理，直至中止、终止对您提供部分或全部UCA服务，UCA对此不承担任何责任，您将承担因此产生的任何直接或间接损失及不利后果。
		</p>
		<p slot="footer" class="dialog-footer">
			<button @click="closeBindShow">
				已阅读协议并同意
			</button>
		</p>
	</el-dialog>
</template>
<script>
export default {
	data() {
		return {
		};
	},
	props: {
      show:{
          required: false,
          type: Boolean
      }
  },
	methods: {
		open() {
			// this.show = true;
		},
      closeBindShow() {
          this.$emit('closeBindShow');
      }
	}
};
</script>
<style lang="scss" scoped="scoped">
h4{
	font-size: 1rem;
}
h5,
p {
	font-size: 0.875rem;
}
h4 ,
p {
	margin-bottom: 1rem;
}
.dialog-footer button {
	color: #FFF;
	background-color: $ThemeColor;
	padding: 10px 20px;
	border-radius: 4px;
}
</style>
