<template>
	<dv-border-box-7 :color="['', '#FFF']">
		<div class="data-title"><span>全国商品交易中心</span></div>
		<dv-scroll-board :config="config" ref="scrollBoard" />
	</dv-border-box-7>
	<!-- <div></div> -->
</template>
<script>
export default {
	data() {
		return {
			config: {
				header: ['企业', '商品', '数量'],
				data: [
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量'],
					['企业名称', '商品名称', '商品数量']
				],
				rowNum: 8,
				headerBGC: '#06076B',
				oddRowBGC: '#02246C',
				evenRowBGC: '#3755DA'
			}
		};
	},
	components: {},
	computed: {},
	mounted() {},
	methods: {
		doUpdate() {
			// this.$refs['scrollBoard'].updateRows(rows, index);
		}
	}
};
</script>
<style lang="scss" scoped="scoped">
.dv-border-box-7 {
	// width: 300px;
	margin-bottom: 1rem;
	.dv-scroll-board {
		height: 504px;
	}
}
</style>
